tutorials/StagDrop/FTStagDrop/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  9.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     9.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;
    div(rhoPhi,U)  Gauss limitedLinearV 1;
    div(densityIGrad)          Gauss linear;
    div(viscosityIGrad)          Gauss linear;
    div(IndicatorGrad)          Gauss linear;
    div(((2*mu)*symm(grad(U))))  Gauss linear;
    div(((1-BB)*IndicatorGrad))   Gauss linear;
	div((mu*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default    Gauss linear corrected;
    laplacian(viscosityIndicator)   Gauss  linear orthogonal;
    laplacian(densityIndicator)   Gauss  linear orthogonal;
    laplacian(indicator)   Gauss  linear orthogonal;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pcorr;
}


// ************************************************************************* //
